# Множество  -  это объект-контейнер уникальных значений, который работает как математическое множество .
#myset = set()   Создание пустого множества
#myset.add()   Добавление элемента в множество
#myset.remove()  Удаление элемента из множества(Вызывает исключение)
#myset.discard()  Удаление элемента из множества (Не вызывает исключение)
#myset.update()  Добавление группы элементов в множество

# for переменная in множество:
    # инструкция
    # инструкция

bascet = {"яблоко","яблоко","персик","груша","виноград","виноград"}
print(bascet)
print('вобла' in bascet)
bascet.add('банан')
print(bascet)
bascet.remove('персик')
print(bascet)